# 第五章 pandas学习

In [1]:
import pandas as pd
from pandas import Series, DataFrame

pd.serier  一组数，类似字典

In [3]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [14]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
3 in obj2.values

True

In [26]:
sdata = {'ohio': 35000, 'texas':71000, 'oregon':16000}
obj3 = pd.Series(sdata)
obj3

ohio      35000
texas     71000
oregon    16000
dtype: int64

In [29]:
states = ['calif','ohio','texas']
obj4 = pd.Series(sdata, index=states)
obj4

calif        NaN
ohio     35000.0
texas    71000.0
dtype: float64

In [31]:
pd.isnull(obj4)

calif     True
ohio     False
texas    False
dtype: bool

In [32]:
pd.notnull(obj4)

calif    False
ohio      True
texas     True
dtype: bool

In [33]:
obj3 + obj4

calif          NaN
ohio       70000.0
oregon         NaN
texas     142000.0
dtype: float64

In [34]:
obj4

calif        NaN
ohio     35000.0
texas    71000.0
dtype: float64

In [36]:
obj4.name = 'obj4'
obj4

calif        NaN
ohio     35000.0
texas    71000.0
Name: obj4, dtype: float64

In [39]:
obj4.index.name = 'State'
obj4

State
calif        NaN
ohio     35000.0
texas    71000.0
Name: obj4, dtype: float64

In [41]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [42]:
obj.index = ['bb','aa','cc','dd']
obj

bb    4
aa    7
cc   -5
dd    3
dtype: int64

DataFrame 表格型的数据结构

In [4]:
import pandas as pd
data = {'state':['ohio','ohio','ohio','nev','nev','nev'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
       }
frame = pd.DataFrame(data)
frame

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6
3   nev  2001  2.4
4   nev  2002  2.9
5   nev  2003  3.2

In [6]:
frame.head()

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6
3   nev  2001  2.4
4   nev  2002  2.9

In [7]:
pd.DataFrame(data,columns=['year','state','pop'])

   year state  pop
0  2000  ohio  1.5
1  2001  ohio  1.7
2  2002  ohio  3.6
3  2001   nev  2.4
4  2002   nev  2.9
5  2003   nev  3.2

In [9]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'], 
             index=['one','two','three','four','five','six'])
frame2

       year state  pop debt
one    2000  ohio  1.5  NaN
two    2001  ohio  1.7  NaN
three  2002  ohio  3.6  NaN
four   2001   nev  2.4  NaN
five   2002   nev  2.9  NaN
six    2003   nev  3.2  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
frame2['state']

one      ohio
two      ohio
three    ohio
four      nev
five      nev
six       nev
Name: state, dtype: object

In [12]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64